{
  "description": "Add an OAuth 2.0 authentication layer with the <a href=\"https://tools.ietf.org/html/rfc6749#section-4.1\" target=\"_blank\">Authorization Code Grant</a>, <a href=\"https://tools.ietf.org/html/rfc6749#section-4.4\" target=\"_blank\">Client Credentials</a>, <a href=\"https://tools.ietf.org/html/rfc6749#section-4.2\" target=\"_blank\">Implicit Grant</a> or <a href=\"https://tools.ietf.org/html/rfc6749#section-4.3\" target=\"_blank\">Resource Owner Password Credentials Grant</a> flow.",
  "fields": {
    "scopes": {
      "description": "Describes an array of comma separated scope names that will be available to the end user."
    },
    "mandatory_scope": {
      "description": "An optional boolean value telling the plugin to require at least one scope to be authorized by the end user."
    },
    "token_expiration": {
      "description": "An optional integer value telling the plugin how many seconds a token should last, after which the client will need to refresh the token. Set to <code>0</code> to disable the expiration."
    },
    "enable_authorization_code": {
      "description": "An optional boolean value to enable the three-legged Authorization Code flow (<a href=\"https://tools.ietf.org/html/rfc6749#section-4.1\" target=\"_blank\">RFC 6742 Section 4.1</a>)."
    },
    "enable_client_credentials": {
      "description": "An optional boolean value to enable the Client Credentials Grant flow (<a href=\"https://tools.ietf.org/html/rfc6749#section-4.4\" target=\"_blank\">RFC 6742 Section 4.4</a>)."
    },
    "enable_implicit_grant": {
      "description": "An optional boolean value to enable the Implicit Grant flow which allows to provision a token as a result of the authorization process (<a href=\"https://tools.ietf.org/html/rfc6749#section-4.2\" target=\"_blank\">RFC 6742 Section 4.2</a>)."
    },
    "enable_password_grant": {
      "description": "An optional boolean value to enable the Resource Owner Password Credentials Grant flow (<a href=\"https://tools.ietf.org/html/rfc6749#section-4.3\" target=\"_blank\">RFC 6742 Section 4.3</a>)."
    },
    "hide_credentials": {
      "description": "An optional boolean value telling the plugin to hide the credential to the upstream API server. It will be removed by Kong before proxying the request."
    },
    "accept_http_if_already_terminated": {
      "description": "Accepts HTTPs requests that have already been terminated by a proxy or load balancer and the <code>x-forwarded-proto: https</code> header has been added to the request. Only enable this option if the Kong server cannot be publicly accessed and the only entry-point is such proxy or load balancer."
    },
    "anonymous": {
      "description": "An optional string (consumer uuid) value to use as an \"anonymous\" consumer if authentication fails. If empty (default), the request will fail with an authentication failure <code>4xx</code>."
    },
    "global_credentials": {
      "description": "An optional boolean value that allows to use the same OAuth credentials generated by the plugin with any other API whose OAuth 2.0 plugin configuration also has <code>global_credentials=true</code>."
    },
    "provision_key": {
      "description": "The backend of your web-application will authenticate the <code>username</code> and <code>password</code> sent by the client, and if successful will add the <code>provision_key</code>."
    }
  }
}
